app/controllers/contacts_controller.rb

  def index
    #Paginaçaão
    #@contacts = Contact.all.page(params[:page])
    #Paginaçaão por página
    #@contacts = Contact.all.page(params[:page]).per(15)
    #Paginaçaão ordenado e com limite de itens por página
    @contacts = Contact.all.order(:name).page(params[:page]).per(15)
---
SELECT  "contacts".* FROM "contacts"  ORDER BY "contacts"."name" ASC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "contacts"

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "José da Silva"], ["email", "jose.silva@teste.com"], ["kind_id", 1], ["rmk", "Teste"], ["created_at", "2019-03-08 13:17:24.142685"], ["updated_at", "2019-03-08 13:17:24.142685"]]

    def set_options_for_select
      @kind_options_for_select = Kind.all
---
SELECT "kinds".* FROM "kinds"