app/controllers/phones_controller.rb

  def index
    #@phones = Phone.all
    respond_to do |format|
      format.html {@phones = Phone.all}
---
SELECT "phones".* FROM "phones"